Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_post_primary_school/senior_cycle.html.txt.tmx
Source language: en
Languages: ga

source: After completing the Junior cycle and sitting the Junior Certificate students begin the Senior Cycle programme
ga: Tar éis dóibh an tSraith Shóisearach a chríochnú agus an Teastas Sóisearach a dhéanamh tosaíonn mic léinn ar chlár na Sraithe Sinsearaí

source: The Senior Cycle generally caters for students from 15 to 18 although the Leaving Certificate is not limited to post-primary students
ga: I gcoitinne déanann an tSraith Shinsearach freastal do mhic léinn idir 15 bliana agus 18 mbliana d’aois cé nach bhfuil an Ardteistiméireacht teoranta do mhic léinn iar-bhunscoile

source: The main programmes that students can follow at Senior Cycle are:
ga: Siad na príomhchláir gur féidir le scoláirí a dhéanamh sa gCóras Sinsearach ná:

source: • The Leaving Certificate Vocational Programme
ga: • An Clár Árdteistéiméireachta Gairmiúil

source: Not all of these programmes are followed in every school
ga: Níl na cláir seo ar fad ar fáil i ngach scoil

source: You must find out what is available in your school or the school you are thinking of attending
ga: Beidh ort fáil amach céard atá ar fáil i do scoil nó sa scoil a bhfuil tú ag smaoineamh ar freastal uirthi

source: Within these programmes, there are a number of compulsory subjects
ga: I ngach ceann de na cláir seo tá roinnt ábhar riachtanacha

source: The subjects that are compulsory vary for different programmes and different types of school
ga: Athraíonn na hábhair atá éigeantach idir cláir éagsúla agus cineálacha éagsúla scoileanna

source: All third-level courses have minimum subject requirements for entry
ga: Tá riachtanais íosta iontrála ann do gach cúrsa tríú leibhéil

source: These often include Maths, English and Irish
ga: Go minic bíonn Matamaitic, Béarla agus Gaeilge ar áireamh ar na hábhair sin

source: You should check these minimum requirements before deciding which subjects to take for the Leaving Certificate
ga: Ba chóir duit na riachtanais íosta sin a sheiceáil sula ndéanann tú cinneadh i dtaobh na n-ábhar a dhéanfaidh tú don Ardteistiméireacht

source: Irish is compulsory in most programmes
ga: Ábhar amháin atá riachtanach i bhformhór na gclár tríú leibhéil ná an Ghaeilge

source: In some very limited circumstances, a student may not have to study Irish
ga: Ag brath ar chúinsí an-teoranta, b'fhéidir nach mbeadh ar an scoláire staidéar a dhéanamh ar an nGaeilge
